app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.order(created_at: :desc)

INSERT INTO "users" ("name", "email", "address", "contact", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "zaina"], ["email", "zaina@email.com"], ["address", "sdkfasdf"], ["contact", "dslfsdf"], ["created_at", "2023-05-16 20:05:43.785277"], ["updated_at", "2023-05-16 20:05:43.785277"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save